system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

convertToMeters 1.0;

vertices
(
    (-5 -2 -2)
    (10 -2 -2)
    (10 2 -2)
    (-5 2 -2)
    (-5 -2 5)
    (10 -2 5)
    (10 2 5)
    (-5 2 5)
);



blocks
(
    hex (0 1 2 3 4 5 6 7) (80 40 20) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces ((0 4 7 3));
    }

    outlet
    {
        type patch;
        faces ((1 2 6 5));
    }

    top
    {
        type wall;
        faces ((3 2 6 7));
    }

    bottom
    {
        type wall;
        faces ((0 1 5 4));
    }

    sides
    {
        type symmetry;
        faces ((0 3 2 1) (4 5 6 7));
    }
);

mergePatchPairs ();
