constant/physicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      physicalProperties;
}

transportModel  Newtonian;
nu              [0 2 -1 0 0 0 0] 1.5e-5;

