0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (60 0 0);  // 30 m/s in x-direction

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform (60 0 0);
    }

    outlet
    {
        type zeroGradient;
    }

    top
    {
        type noSlip;
    }

    bottom
    {
        type noSlip;
    }

    sides
    {
        type symmetry;
    }

    f1car
    {
        type noSlip;
    }
}

