0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.01;
boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform 0.03;
    }

    outlet
    {
        type zeroGradient;
    }

    top
    {
        type zeroGradient;
    }

    bottom
    {
        type zeroGradient;
    }

    sides
    {
        type symmetry;
    }

    f1car
    {
        type kqRWallFunction;
        value uniform 0.0;
    }
}

