0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox          |
|  \\    /   O peration     | Version: 12                                    |
|   \\  /    A nd           | Website: https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];  // units: m^2/s

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type calculated;
        value uniform 0;
    }

    outlet
    {
        type calculated;
        value uniform 0;
    }

    top
    {
        type calculated;
        value uniform 0;
    }

    bottom
    {
        type calculated;
        value uniform 0;
    }

    sides
    {
        type symmetry;
    }

    f1car
    {
        type nutUSpaldingWallFunction;
        value uniform 0;
    }
}

