system/decomposeParDict
FoamFile { version 2.0; format ascii; class dictionary; object decomposeParDict; }
numberOfSubdomains 2;
method simple;
simpleCoeffs {
    n (2 1 1);
    delta 0.001;
};
distributed no;
roots ();